Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: *Metadata:* A key element of the Yocto Project is the Metadata that is used to construct a Linux distribution and is contained in the files that the OpenEmbedded build system parses when building an image. In general, Metadata includes recipes, configuration files, and other information that refers to the build instructions themselves, as well as the data used to control what things get built and the effects of the build. Metadata also includes commands and data used to indicate what versions of software are used, from where they are obtained, and changes or additions to the software itself (patches or auxiliary files) that are used to fix bugs or customize the software for use in a particular situation. OpenEmbedded-Core is an important set of validated metadata.
it_it: *Metadata:* Un elemento chiave di Yocto Project sono i metadati, utilizzati per costruire una distribuzione Linux e contenuti nei file che il sistema di build OpenEmbedded analizza durante la creazione di un'immagine. In generale, i metadati includono ricette, file di configurazione e altre informazioni che si riferiscono alle istruzioni di build stesse, nonché i dati utilizzati per controllare cosa viene compilato e gli effetti della build. I metadati includono anche comandi e dati utilizzati per indicare quali versioni del software vengono utilizzate, da dove vengono ottenute e modifiche o aggiunte al software stesso (patch o file ausiliari) utilizzate per correggere bug o personalizzare il software per l'uso in una situazione particolare. OpenEmbedded-Core è un importante insieme di metadati validati.

source: *Native Linux Host:* By far the best option for a Build Host. A system running Linux as its native operating system allows you to develop software by directly using the :term:`BitBake` tool. You can accomplish all aspects of development from a regular shell in a supported Linux distribution.
it_it: *Host Linux Nativo:* Di gran lunga l'opzione migliore per un Build Host. Un sistema con Linux come sistema operativo nativo consente di sviluppare software utilizzando direttamente il tool :term:`BitBake`. È possibile eseguire tutti gli aspetti dello sviluppo da una normale shell in una distribuzione Linux supportata.

source: *Navigate to Your Source Directory:* Typically, you set up the ``meta-intel`` Git repository next to the other layers in your build.
it_it: *Accedere alla Directory dei Sorgenti:* In genere, il repository Git ``meta-intel`` viene posizionato accanto agli altri layer della build.

source: *Not using $D in front of absolute paths:* The build system defines ``$``\ :term:`D` when the root filesystem is created. Furthermore, ``$D`` is blank when the script is run on the target device. This implies two purposes for ``$D``: ensuring paths are valid in both the host and target environments, and checking to determine which environment is being used as a method for taking appropriate actions.
it_it: *Mancato utilizzo di $D davanti ai path assoluti:* Il sistema di build definisce ``$``\ :term:`D` quando viene creato il filesystem root. Inoltre, ``$D`` è vuoto quando lo script viene eseguito sul dispositivo target. Ciò implica due scopi per ``$D``: garantire che i path siano validi sia nell'ambiente host che in quello target e verificare quale ambiente viene utilizzato per intraprendere le azioni appropriate.

source: *OCI Containers:* Typically, you use an :wikipedia:`OCI container <Open_Container_Initiative>` (with `Docker <https://www.docker.com/>`__ or `Podman <https://podman.io/>`__ for example), to set up a :term:`Build Host` that is not running Linux (e.g. Microsoft Windows or macOS).
it_it: *OCI Containers:* In genere, si utilizza un :wikipedia:`OCI container <Open_Container_Initiative>` (ad esempio, con `Docker <https://www.docker.com/>`__ o `Podman <https://podman.io/>`__), per configurare un :term:`Build Host` che non esegue Linux (ad esempio, Microsoft Windows o macOS).

source: *OpenEmbedded Build System:* The terms "BitBake" and "build system" are sometimes used for the OpenEmbedded Build System.
it_it: *Sistema di Build OpenEmbedded:* I termini "BitBake" e "sistema di build" vengono talvolta utilizzati per indicare l'OpenEmbedded Build System.

source: *OpenEmbedded-Core (OE-Core):* OE-Core is metadata comprised of foundation recipes, classes, and associated files that are meant to be common among many different OpenEmbedded-derived systems, including the Yocto Project. OE-Core is a curated subset of an original repository developed by the OpenEmbedded community that has been pared down into a smaller, core set of continuously validated recipes. The result is a tightly controlled and quality-assured core set of recipes.
it_it: *OpenEmbedded-Core (OE-Core):* OE-Core è un insieme di metadati composto da ricette di base, classi e file associati, pensati per essere comuni a molti sistemi derivati ​​da OpenEmbedded, incluso Yocto Project. OE-Core è un sottoinsieme curato di un repository originale sviluppato dalla comunità OpenEmbedded, ridotto a un insieme più piccolo e centrale di ricette continuamente validate. Il risultato è un insieme di ricette di base rigorosamente controllato e di qualità garantita.

source: *OpenEmbedded-Core:* :term:`OpenEmbedded-Core (OE-Core)` is a common layer of metadata (i.e. recipes, classes, and associated files) used by OpenEmbedded-derived systems, which includes the Yocto Project. The Yocto Project and the OpenEmbedded Project both maintain the OpenEmbedded-Core. You can find the OE-Core metadata in the OpenEmbedded :oe_git:`Source Repositories </openembedded-core/>`.
it_it: *OpenEmbedded-Core:* :term:`OpenEmbedded-Core (OE-Core)` è un layer comune di metadati (ovvero ricette, classi e file associati) utilizzato dai sistemi derivati ​​da OpenEmbedded, incluso il Yocto Project. Sia Yocto Project che il Progetto OpenEmbedded mantengono OpenEmbedded-Core. È possibile trovare i metadati di OE-Core nei repository sorgente di OpenEmbedded :oe_git:`Source Repositories </openembedded-core/>`.

source: *Opkg:* Open PacKaGe management (opkg) is a lightweight package management system based on the itsy package (ipkg) management system. Opkg is written in C and resembles Advanced Package Tool (APT) and Debian Package (dpkg) in operation.
it_it: *Opkg:* Open PacKaGe management (opkg) è un sistema di gestione dei pacchetti leggero basato sul sistema di gestione dei pacchetti itsy (ipkg). Opkg è scritto in C e il suo funzionamento è simile a quello di Advanced Package Tool (APT) e Debian Package (dpkg).

source: *Optionally Clone the meta-intel BSP Layer:* If your hardware is based on current Intel CPUs and devices, you can leverage this BSP layer. For details on the ``meta-intel`` BSP layer, see the layer's :yocto_git:`README </meta-intel/tree/README.md>` file.
it_it: *Clonare Facoltativamente il Layer BSP meta-intel:* Se l'hardware si basa su CPU e dispositivi Intel attuali, si può utilizzare questo layer BSP. Per maggiori dettagli sul layer BSP ``meta-intel``, consultare il file :yocto_git:`README </meta-intel/tree/README.md>` del layer.

source: *Optionally Set Up an Alternative BSP Layer:* If your hardware can be more closely leveraged to an existing BSP not within the ``meta-intel`` BSP layer, you can clone that BSP layer.
it_it: *Configurazione Facoltativa di un Layer BSP Alternativo:* Se l'hardware può essere utilizzato più facilmente con un BSP esistente non incluso nel layer BSP ``meta-intel``, si può clonare tale layer BSP.

source: *Package Feeds:* Directories containing output packages (RPM, DEB or IPK), which are subsequently used in the construction of an image or Software Development Kit (SDK), produced by the build system. These feeds can also be copied and shared using a web server or other means to facilitate extending or updating existing images on devices at runtime if runtime package management is enabled.
it_it: *Flussi di Pacchetti:* Directory contenenti i pacchetti di output (RPM, DEB o IPK), che vengono successivamente utilizzati per la creazione di un'immagine o di un Software Development Kit (SDK) prodotti dal sistema di build. Questi flussi possono anche essere copiati e condivisi tramite un server web o altri mezzi per facilitare l'estensione o l'aggiornamento delle immagini esistenti sui dispositivi in ​​fase di esecuzione, se la gestione dei pacchetti in fase di esecuzione è abilitata.

source: *Packages:* In the context of the Yocto Project, this term refers to a recipe's packaged output produced by BitBake (i.e. a "baked recipe"). A package is generally the compiled binaries produced from the recipe's sources. You "bake" something by running it through BitBake.
it_it: *Pacchetti:* Nel contesto di Yocto Project, questo termine si riferisce all'output impacchettato di una ricetta prodotto da BitBake (ovvero una "baked recipe"). Un pacchetto è generalmente costituito dai binari compilati prodotti dai sorgenti della ricetta. Si "impacchetta" qualcosa eseguendola tramite BitBake.

source: *Packaging Format:* Controlled by the :term:`PACKAGE_CLASSES` variable.
it_it: *Formato del Packaging:* Controllato dalla variabile :term:`PACKAGE_CLASSES`.

source: *Patch Workflow:* This workflow allows you to notify the maintainer through an email that you have a change (or patch) you would like considered for the development branch of the Git repository. To send this type of change, you format the patch and then send the email using the Git commands ``git format-patch`` and ``git send-email``. For information on how to use these scripts, see the ":doc:`/contributor-guide/submit-changes`" section in the Yocto Project and OpenEmbedded Contributor Guide.
it_it: *Flusso di Lavoro per le Patch:* Questo flusso di lavoro consente di notificare al manutentore, tramite e-mail, che si ha una modifica (o patch) da prendere in considerazione per il branch di sviluppo del repository Git. Per inviare questo tipo di modifica, formattare la patch e inviare l'e-mail utilizzando i comandi Git ``git format-patch`` e ``git send-email``. Per informazioni su come utilizzare questi script, consultare la sezione ":doc:`/contributor-guide/submit-changes`" nella Guida per i Collaboratori di Yocto Project e di OpenEmbedded.

source: *Patchwork:* `Patchwork <https://patchwork.yoctoproject.org/>`__ is a fork of a project originally started by `OzLabs <https://ozlabs.org/>`__. The project is a web-based tracking system designed to streamline the process of bringing contributions into a project. The Yocto Project uses Patchwork as an organizational tool to handle patches, which number in the thousands for every release.
it_it: *Patchwork:* `Patchwork <https://patchwork.yoctoproject.org/>`__ è un fork di un progetto originariamente avviato da `OzLabs <https://ozlabs.org/>`__. Il progetto è un sistema di tracciamento basato sul web, progettato per semplificare il processo di integrazione dei contributi in un progetto. Yocto Project utilizza Patchwork come strumento organizzativo per gestire le patch, che sono migliaia per ogni release.

source: *Performance Data:* This `video <https://www.youtube.com/watch?v=qWGMrJoqusQ>`__ shows the build performance data provided by Toaster.
it_it: *Performance Data:* Questo `video <https://www.youtube.com/watch?v=qWGMrJoqusQ>`__ mostra i dati sulle prestazioni di build forniti da Toaster.

source: *Persistent Data Directory:* Controlled by the :term:`PERSISTENT_DIR` variable.
it_it: *Directory dei Dati Persistenti:* Controllata dalla variabile :term:`PERSISTENT_DIR`.

source: *Poky:* Poky is a reference embedded distribution and a reference test configuration. Poky provides the following:
it_it: *Poky:* Poky è una distribuzione embedded di riferimento e una configurazione di test di riferimento. Poky fornisce quanto segue:

source: *Policy Configuration:* Distribution Layers (i.e. "Distro Layer" in the following figure) providing top-level or general policies for the images or SDKs being built for a particular distribution. For example, in the Poky Reference Distribution the distro layer is the :yocto_git:`meta-poky </meta-yocto/tree/meta-poky>` layer. Within the distro layer is a ``conf/distro`` directory that contains distro configuration files (e.g. :yocto_git:`poky.conf </meta-yocto/tree/meta-poky/conf/distro/poky.conf>` that contain many policy configurations for the :term:`Poky` distribution.
it_it: *Configurazione delle Policy:* I layer di distribuzione (ovvero "Distro Layer" nella figura seguente) forniscono policy di alto livello o generali per le immagini o gli SDK che vengono compilati per una particolare distribuzione. Ad esempio, nella Poky Reference Distribution, il layer della distro è :yocto_git:`meta-poky </meta-yocto/tree/meta-poky>`. All'interno del layer distro è presente una directory ``conf/distro`` che contiene i file di configurazione della distribuzione (ad esempio, :yocto_git:`poky.conf </meta-yocto/tree/meta-poky/conf/distro/poky.conf>` che contengono numerose configurazioni di policy per la distribuzione :term:`Poky`.

source: *Prepare for the Build:* Once you have made all the changes to your BSP layer, there remains a few things you need to do for the OpenEmbedded build system in order for it to create your image. You need to get the build environment ready by sourcing an environment setup script (i.e. ``oe-init-build-env``) and you need to be sure two key configuration files are configured appropriately: the :ref:`structure-build-conf-local.conf` and the :ref:`structure-build-conf-bblayers.conf` file. You must make the OpenEmbedded build system aware of your new layer. See the ":ref:`dev-manual/layers:enabling your layer`" section in the Yocto Project Development Tasks Manual for information on how to let the build system know about your new layer.
it_it: *Preparazione per la Build:* Una volta apportate tutte le modifiche al layer BSP, restano alcune operazioni da eseguire affinché il sistema di build OpenEmbedded possa creare l'immagine. È necessario preparare l'ambiente di compilazione eseguendo uno script di configurazione dell'ambiente (ad esempio ``oe-init-build-env``) e assicurarsi che due file di configurazione chiave siano configurati correttamente: il file :ref:`structure-build-conf-local.conf` e il file :ref:`structure-build-conf-bblayers.conf`. È necessario rendere il sistema di build OpenEmbedded a conoscenza del nuovo layer. Consultare la sezione ":ref:`dev-manual/layers:enabling your layer`" nel Manuale di Sviluppo dei Task di Yocto Project per informazioni su come far conoscere il nuovo layer al sistema di compilazione.

source: *Prepare the Source Repositories*:
it_it: *Preparazione dei Repository Sorgente*:

source: *Project Workflow Could Be Confusing:* The :ref:`Yocto Project workflow <overview-manual/development-environment:the yocto project development environment>` could be confusing if you are used to traditional desktop and server software development. In a desktop development environment, there are mechanisms to easily pull and install new packages, which are typically pre-compiled binaries from servers accessible over the Internet. Using the Yocto Project, you must modify your configuration and rebuild to add additional packages.
it_it: *Il Flusso di Lavoro del Progetto Potrebbe Risultare Complesso:* Il :ref:`workflow di Yocto Project <overview-manual/development-environment:the yocto project development environment>` potrebbe risultare complesso per chi è abituato allo sviluppo software tradizionale per desktop e server. In un ambiente di sviluppo desktop, esistono meccanismi per scaricare e installare facilmente nuovi pacchetti, che in genere sono binari precompilati da server accessibili tramite Internet. Con Yocto Project, è necessario modificare la configurazione e ricompilare il progetto per aggiungere pacchetti aggiuntivi.

source: *Pseudo:* Pseudo is the Yocto Project implementation of :manpage:`fakeroot <fakeroot(1)>`, which is used to run commands in an environment that seemingly has root privileges.
it_it: *Pseudo:* Pseudo è l'implementazione in Yocto Project di :manpage:`fakeroot <fakeroot(1)>`, utilizzato per eseguire comandi in un ambiente che apparentemente dispone di privilegi di root.

source: *Push Your Commits to the "Contrib" Upstream:* Push your changes to that repository::
it_it: *Eseguire il Push dei Commit al Repository "Contrib" Upstream:* Eseguire il push delle modifiche a quel repository::

source: *README File:* You must include a ``README`` file in the ``meta-bsp_root_name`` directory. See the :yocto_git:`README.md </meta-raspberrypi/tree/README.md>` file for the Raspberry Pi BSP in the ``meta-raspberrypi`` BSP layer as an example.
it_it: *File README:* È necessario includere un file ``README`` nella directory ``meta-bsp_root_name``. Vedere il file :yocto_git:`README.md </meta-raspberrypi/tree/README.md>` per il BSP Raspberry Pi nel layer BSP ``meta-raspberrypi`` come esempio.

source: *README.sources File:* If your BSP contains binary images in the ``binary`` directory, you must include a ``README.sources`` file in the ``meta-bsp_root_name`` directory. This file specifies exactly where you can find the sources used to generate the binary images.
it_it: *File README.sources:* Se il BSP contiene immagini binarie nella directory ``binary``, è necessario includere un file ``README.sources`` nella directory ``meta-bsp_root_name``. Questo file specifica esattamente dove trovare i sorgenti utilizzati per generare le immagini binarie.

source: *Recipe Reporting System:* The Recipe Reporting System tracks recipe versions available for Yocto Project. The main purpose of the system is to help you manage the recipes you maintain and to offer a dynamic overview of the project. The Recipe Reporting System is built on top of the :oe_layerindex:`OpenEmbedded Layer Index <>`, which is a website that indexes OpenEmbedded-Core layers.
it_it: *Recipe Reporting System:* Il sistema di segnalazione delle ricette tiene traccia delle versioni delle ricette disponibili per Yocto Project. Lo scopo principale del sistema è quello di aiutare a gestire le ricette mantenute e di offrire una panoramica dinamica del progetto. Il sistema di segnalazione delle ricette si basa su :oe_layerindex:`OpenEmbedded Layer Index <>`, un sito web che indicizza i layer di OpenEmbedded-Core.

source: *Recipe:* The most common form of metadata. A recipe contains a list of settings and tasks (i.e. instructions) for building packages that are then used to build the binary image. A recipe describes where you get source code and which patches to apply. Recipes describe dependencies for libraries or for other recipes as well as configuration and compilation options. Related recipes are consolidated into a layer.
it_it: *Ricetta:* La forma più comune di metadati. Una ricetta contiene un elenco di impostazioni e task (ovvero istruzioni) per la creazione di pacchetti che vengono poi utilizzati per costruire l'immagine binaria. Una ricetta descrive da dove reperire il codice sorgente e quali patch applicare. Le ricette descrivono le dipendenze per le librerie o per altre ricette, nonché le opzioni di configurazione e compilazione. Le ricette correlate sono consolidate in un layer.

source: *Recipes and Packages Built:* This `video <https://www.youtube.com/watch?v=x-6dx4huNnw>`__ shows the information Toaster provides about recipes and packages built.
it_it: *Recipes and Packages Built:* Questo `video <https://www.youtube.com/watch?v=x-6dx4huNnw>`__ mostra le informazioni fornite da Toaster sulle ricette e sui pacchetti creati.

source: *Recipes:* Provides details about particular pieces of software.
it_it: *Ricette:* Forniscono dettagli su specifiche parti software.

source: *Reference Material:* This type of material resides in an appropriate reference manual. For example, system variables are documented in the :doc:`/ref-manual/index`. As another example, the :doc:`/bsp-manual/index` contains reference information on BSPs.
it_it: *Materiale di Riferimento:* Questo tipo di materiale si trova in un apposito manuale di riferimento. Ad esempio, le variabili di sistema sono documentate nel file :doc:`/ref-manual/index`. Un altro esempio è il file :doc:`/bsp-manual/index`, che contiene informazioni di riferimento sui BSP (Business Support Package).

source: *Releases According to a Strict Schedule:* Major releases occur on a :doc:`six-month cycle </ref-manual/release-process>` predictably in October and April. The most recent two releases support point releases to address common vulnerabilities and exposures. This predictability is crucial for projects based on the Yocto Project and allows development teams to plan activities.
it_it: *Rilasci Secondo una Pianificazione Rigorosa:* I rilasci principali avvengono con una :doc:`cadenza semestrale </ref-manual/release-process>`, prevedibilmente a ottobre e aprile. Gli ultimi due rilasci includono aggiornamenti per risolvere vulnerabilità e punti deboli comuni. Questa prevedibilità è fondamentale per i progetti basati su Yocto Project e consente ai team di sviluppo di pianificare le attività.

source: *Request Push Access to an "Upstream" Contrib Repository:* Send an email to ``helpdesk@yoctoproject.org``:
it_it: *Richiedere l'Accesso in Push a un Repository "Upstream" Contrib:* Inviare un'email a ``helpdesk@yoctoproject.org``:

source: *Review each of the Patch Files:* This final review of the patches before sending them often allows to view your changes from a different perspective and discover defects such as typos, spacing issues or lines or even files that you didn't intend to modify. This review should include the cover letter patch too.
it_it: *Rivedere Ogni File di Patch:* Questa revisione finale delle patch prima dell'invio consente spesso di visualizzare le modifiche da una prospettiva diversa e di individuare difetti come errori di battitura, problemi di spaziatura o di riga, o persino file che non si intendevano modificare. Questa revisione dovrebbe includere anche la patch della lettera di presentazione.

source: *Rich Ecosystem of Individuals and Organizations:* For open source projects, the value of community is very important. Support forums, expertise, and active developers who continue to push the Yocto Project forward are readily available.
it_it: *Un Ricco Ecosistema di Individui e Organizzazioni:* Per i progetti open source, il valore della community è molto importante. Forum di supporto, competenze e sviluppatori attivi che continuano a far progredire Yocto Project sono facilmente reperibili.

source: *SDK Target Architecture:* Controlled by the :term:`SDKMACHINE` variable.
it_it: *Architettura Target dell'SDK:* Controllata dalla variabile :term:`SDKMACHINE`.

source: *Search by File:* Using :ref:`overview-manual/development-environment:git`, you can enter the following command to bring up a short list of all commits against a specific file::
it_it: *Ricercare per File:* Utilizzando :ref:`overview-manual/development-environment:git`, è possibile inserire il seguente comando per visualizzare un breve elenco di tutti i commit relativi a un file specifico::

source: *Set Up the Build Environment:* Be sure you are set up to use BitBake in a shell. See the ":ref:`dev-manual/start:preparing the build host`" section in the Yocto Project Development Tasks Manual for information on how to get a :term:`build host` ready.
it_it: *Configurazione dell'Ambiente di Build:* Assicurarsi di aver configurato BitBake in una shell. Consultare la sezione ":ref:`dev-manual/start:preparing the build host`" section nel Manuale di Sviluppo dei Task di Yocto Project per informazioni su come preparare un :term:`build host`.
